In [1]:
import numpy as  np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd' ,'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['bule', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      bule
2    purple
4    yellow
dtype: object

In [7]:
obj3.reindex(range(6), method='ffill')

0      bule
1      bule
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [8]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'b', 'c'],
                     columns=['ohio', 'texas', 'califolnia'])
frame

   ohio  texas  califolnia
a     0      1           2
b     3      4           5
c     6      7           8

In [9]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   ohio  texas  califolnia
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [10]:
states = ['texas', 'utah', 'califolnia']
frame.reindex(columns=states)

   texas  utah  califolnia
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [14]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [15]:
new_obj = obj.drop('c')

In [16]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['ohio', 'colorado', 'utah', 'newyork'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [19]:
data.drop(['colorado', 'ohio'])

         one  two  three  four
utah       8    9     10    11
newyork   12   13     14    15

In [20]:
data.drop('two', axis=1)

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
newyork    12     14    15

In [22]:
data.drop(['two', 'four'], axis='columns')

          one  three
ohio        0      2
colorado    4      6
utah        8     10
newyork    12     14

In [27]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [28]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [29]:
obj['b']

1.0

In [30]:
obj[1]

1.0

In [31]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [32]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [33]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [34]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [36]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [37]:
obj['b':'c'] = 5

In [38]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [42]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['ohio', 'colorado', 'utah', 'new york'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [43]:
data['two']

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [44]:
data[['three', 'one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

In [45]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [ ]:
data[data[]]